# CanInsertRow Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..CanInsertRow Method
TableSectionData Class See Also
---
Verifies if a new row can be inserted at the given index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool CanInsertRow(
	int nIndex
)
```

Visual Basic
---
```text
Public Function CanInsertRow ( _
	nIndex As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanInsertRow(
	int nIndex
)
```

# ### Parameters
nIndex
    Type: System..::..Int32
# ### Return Value
True if the row can be inserted, false otherwise.
# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace